{"modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"config": {"name": "sequential_3", "layers": [{"config": {"units": 8, "bias_regularizer": null, "dtype": "float32", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 3], "use_bias": true, "activation": "relu", "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "name": "dense_8", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"units": 4, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "relu", "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "name": "dense_9", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"units": 1, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "linear", "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "name": "dense_10", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}]}, "class_name": "Sequential"}, "training_config": {"loss_weights": null, "optimizer_config": {"config": {"epsilon": 1e-07, "decay": 0.0, "lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "amsgrad": false}, "class_name": "Adam"}, "metrics": ["accuracy"], "loss": "mean_absolute_percentage_error", "sample_weight_mode": null}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "dense_10/kernel", "shape": [4, 1], "dtype": "float32"}, {"name": "dense_10/bias", "shape": [1], "dtype": "float32"}, {"name": "dense_8/kernel", "shape": [3, 8], "dtype": "float32"}, {"name": "dense_8/bias", "shape": [8], "dtype": "float32"}, {"name": "dense_9/kernel", "shape": [8, 4], "dtype": "float32"}, {"name": "dense_9/bias", "shape": [4], "dtype": "float32"}]}]}